stm32duino/Arduino_Core_STM32/libraries/SrcWrapper/src/stm32/uart.c
/*
 *******************************************************************************
 * Copyright (c) 2016-2021, STMicroelectronics
 * All rights reserved.
 *
 * This software component is licensed by ST under BSD 3-Clause license,
 * the "License"; You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                        opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */
#include "core_debug.h"
#include "lock_resource.h"
#include "uart.h"
#include "Arduino.h"
#include "PinAF_STM32F1.h"
#include "stm32yyxx_ll_rcc.h"

#ifdef __cplusplus
extern "C" {
#endif
#if defined(HAL_UART_MODULE_ENABLED) && !defined(HAL_UART_MODULE_ONLY)

/* If DEBUG_UART is not defined assume this is the one linked to PIN_SERIAL_TX */
#if !defined(DEBUG_UART)
#if defined(PIN_SERIAL_TX)
#define DEBUG_UART          pinmap_peripheral(digitalPinToPinName(PIN_SERIAL_TX), PinMap_UART_TX)
#define DEBUG_PINNAME_TX    digitalPinToPinName(PIN_SERIAL_TX)
#else
/* No debug UART defined */
#define DEBUG_UART          NP
#define DEBUG_PINNAME_TX    NC
#endif
#endif
#if !defined(DEBUG_UART_BAUDRATE)
#define DEBUG_UART_BAUDRATE 9600
#endif

/* @brief uart characteristics */
typedef enum {
#if defined(USART1_BASE)
  UART1_INDEX,
#endif
#if defined(USART2_BASE)
  UART2_INDEX,
#endif
#if defined(USART3_BASE)
  UART3_INDEX,
#endif
#if defined(UART4_BASE) || defined(USART4_BASE)
  UART4_INDEX,
#endif
#if defined(UART5_BASE) || defined(USART5_BASE)
  UART5_INDEX,
#endif
#if defined(USART6_BASE)
  UART6_INDEX,
#endif
#if defined(UART7_BASE) || defined(USART7_BASE)
  UART7_INDEX,
#endif
#if defined(UART8_BASE) || defined(USART8_BASE)
  UART8_INDEX,
#endif
#if defined(UART9_BASE)
  UART9_INDEX,
#endif
#if defined(UART10_BASE) || defined(USART10_BASE)
  UART10_INDEX,
#endif
#if defined(USART11_BASE)
  UART11_INDEX,
#endif
#if defined(UART12_BASE)
  UART12_INDEX,
#endif
#if defined(LPUART1_BASE)
  LPUART1_INDEX,
#endif
#if defined(LPUART2_BASE)
  LPUART2_INDEX,
#endif
#if defined(LPUART3_BASE)
  LPUART3_INDEX,
#endif
  UART_NUM
} uart_index_t;

static UART_HandleTypeDef *uart_handlers[UART_NUM] = {NULL};
static serial_t serial_debug = {
  .uart = NP,
  .pin_tx = NC,
  .pin_rx = NC,
  .pin_rts = NC,
  .pin_cts = NC,
  .index = UART_NUM
};

/* Aim of the function is to get serial_s pointer using huart pointer */
/* Highly inspired from magical linux kernel's "container_of" */
serial_t *get_serial_obj(UART_HandleTypeDef *huart)
{
  struct serial_s *obj_s;
  serial_t *obj;

  obj_s = (struct serial_s *)((char *)huart - offsetof(struct serial_s, handle));
  obj = (serial_t *)((char *)obj_s - offsetof(serial_t, uart));

  return (obj);
}

/**
  * @brief  Function called to initialize the uart interface
  * @param  obj : pointer to serial_t structure
  * @retval boolean status
  */
bool uart_init(serial_t *obj, uint32_t baudrate, uint32_t databits, uint32_t parity, uint32_t stopbits, bool rx_invert, bool tx_invert, bool data_invert)
{
  if (obj == NULL) {
    return false;
  }

  UART_HandleTypeDef *huart = &(obj->handle);

  /* Determine the U(S)ART peripheral to use (USART1, USART2, ...) */
  USART_TypeDef *uart_tx = pinmap_peripheral(obj->pin_tx, PinMap_UART_TX);
  USART_TypeDef *uart_rx = pinmap_peripheral(obj->pin_rx, PinMap_UART_RX);
  USART_TypeDef *uart_rts = pinmap_peripheral(obj->pin_rts, PinMap_UART_RTS);
  USART_TypeDef *uart_cts = pinmap_peripheral(obj->pin_cts, PinMap_UART_CTS);
  /* Check if pins are swapped */
#if defined(UART_ADVFEATURE_SWAP_INIT)
  USART_TypeDef *uart_tx_swap = pinmap_peripheral(obj->pin_tx, PinMap_UART_RX);
  USART_TypeDef *uart_rx_swap = pinmap_peripheral(obj->pin_rx, PinMap_UART_TX);
#else
  /* Pin swap not supported */
  USART_TypeDef *uart_tx_swap = NP;
  USART_TypeDef *uart_rx_swap = NP;
#endif

  /* Pin Tx must not be NP */
  if ((uart_tx == NP) && (uart_tx_swap == NP)) {
    if (obj != &serial_debug) {
      core_debug("ERROR: [U(S)ART] Tx pin has no peripheral!\n");
    }
    return false;
  }
  /* Pin Rx must not be NP if not half-duplex */
  if ((obj->pin_rx != NC) && (uart_rx == NP) && (uart_rx_swap == NP)) {
    if (obj != &serial_debug) {
      core_debug("ERROR: [U(S)ART] Rx pin has no peripheral!\n");
    }
    return false;
  }
  /* Pin RTS must not be NP if flow control is enabled */
  if ((obj->pin_rts != NC) && (uart_rts == NP)) {
    if (obj != &serial_debug) {
      core_debug("ERROR: [U(S)ART] RTS pin has no peripheral!\n");
    }
    return false;
  }
  /* Pin CTS must not be NP if flow control is enabled */
  if ((obj->pin_cts != NC) && (uart_cts == NP)) {
    if (obj != &serial_debug) {
      core_debug("ERROR: [U(S)ART] CTS pin has no peripheral!\n");
    }
    return false;
  }

  /*
   * Get the peripheral name (USART1, USART2, ...) from the pin
   * and assign it to the object
   */
  obj->uart = pinmap_merge_peripheral(uart_tx, uart_rx);
  if (obj->uart == NP) {
    /* Regular pins not matched, check if they can be swapped */
    obj->uart = pinmap_merge_peripheral(uart_tx_swap, uart_rx_swap);
  }
  /* We also merge RTS/CTS and assert all pins belong to the same instance */
  obj->uart = pinmap_merge_peripheral(obj->uart, uart_rts);
  obj->uart = pinmap_merge_peripheral(obj->uart, uart_cts);

  if (obj->uart == NP) {
    if (obj != &serial_debug) {
      core_debug("ERROR: [U(S)ART] Rx/Tx/RTS/CTS pins peripherals mismatch!\n");
    }
    return false;
  }

  /* Enable USART clock */
#if defined(USART1_BASE)
  else if (obj->uart == USART1) {
    __HAL_RCC_USART1_FORCE_RESET();
    __HAL_RCC_USART1_RELEASE_RESET();
    __HAL_RCC_USART1_CLK_ENABLE();
    obj->index = UART1_INDEX;
    obj->irq = USART1_IRQn;
  }
#endif
#if defined(USART2_BASE)
  else if (obj->uart == USART2) {
    __HAL_RCC_USART2_FORCE_RESET();
    __HAL_RCC_USART2_RELEASE_RESET();
    __HAL_RCC_USART2_CLK_ENABLE();
    obj->index = UART2_INDEX;
    obj->irq = USART2_IRQn;
  }
#endif
#if defined(USART3_BASE)
  else if (obj->uart == USART3) {
    __HAL_RCC_USART3_FORCE_RESET();
    __HAL_RCC_USART3_RELEASE_RESET();
    __HAL_RCC_USART3_CLK_ENABLE();
    obj->index = UART3_INDEX;
    obj->irq = USART3_IRQn;
  }
#endif
#if defined(UART4_BASE)
  else if (obj->uart == UART4) {
    __HAL_RCC_UART4_FORCE_RESET();
    __HAL_RCC_UART4_RELEASE_RESET();
    __HAL_RCC_UART4_CLK_ENABLE();
    obj->index = UART4_INDEX;
    obj->irq = UART4_IRQn;
  }
#elif defined(USART4_BASE)
  else if (obj->uart == USART4) {
    __HAL_RCC_USART4_FORCE_RESET();
    __HAL_RCC_USART4_RELEASE_RESET();
    __HAL_RCC_USART4_CLK_ENABLE();
    obj->index = UART4_INDEX;
    obj->irq = USART4_IRQn;
  }
#endif
#if defined(UART5_BASE)
  else if (obj->uart == UART5) {
    __HAL_RCC_UART5_FORCE_RESET();
    __HAL_RCC_UART5_RELEASE_RESET();
    __HAL_RCC_UART5_CLK_ENABLE();
    obj->index = UART5_INDEX;
    obj->irq = UART5_IRQn;
  }
#elif defined(USART5_BASE)
  else if (obj->uart == USART5) {
    __HAL_RCC_USART5_FORCE_RESET();
    __HAL_RCC_USART5_RELEASE_RESET();
    __HAL_RCC_USART5_CLK_ENABLE();
    obj->index = UART5_INDEX;
    obj->irq = USART5_IRQn;
  }
#endif
#if defined(USART6_BASE)
  else if (obj->uart == USART6) {
    __HAL_RCC_USART6_FORCE_RESET();
    __HAL_RCC_USART6_RELEASE_RESET();
    __HAL_RCC_USART6_CLK_ENABLE();
    obj->index = UART6_INDEX;
    obj->irq = USART6_IRQn;
  }
#endif
#if defined(LPUART1_BASE)
  else if (obj->uart == LPUART1) {
    __HAL_RCC_LPUART1_FORCE_RESET();
    __HAL_RCC_LPUART1_RELEASE_RESET();
    __HAL_RCC_LPUART1_CLK_ENABLE();
    obj->index = LPUART1_INDEX;
    obj->irq = LPUART1_IRQn;
  }
#endif
#if defined(LPUART2_BASE)
  else if (obj->uart == LPUART2) {
    __HAL_RCC_LPUART2_FORCE_RESET();
    __HAL_RCC_LPUART2_RELEASE_RESET();
    __HAL_RCC_LPUART2_CLK_ENABLE();
    obj->index = LPUART2_INDEX;
    obj->irq = LPUART2_IRQn;
  }
#endif
#if defined(LPUART3_BASE)
  else if (obj->uart == LPUART3) {
    __HAL_RCC_LPUART3_FORCE_RESET();
    __HAL_RCC_LPUART3_RELEASE_RESET();
    __HAL_RCC_LPUART3_CLK_ENABLE();
    obj->index = LPUART3_INDEX;
    obj->irq = LPUART3_IRQn;
  }
#endif
#if defined(UART7_BASE)
  else if (obj->uart == UART7) {
    __HAL_RCC_UART7_FORCE_RESET();
    __HAL_RCC_UART7_RELEASE_RESET();
    __HAL_RCC_UART7_CLK_ENABLE();
    obj->index = UART7_INDEX;
    obj->irq = UART7_IRQn;
  }
#elif defined(USART7_BASE)
  else if (obj->uart == USART7) {
    __HAL_RCC_USART7_FORCE_RESET();
    __HAL_RCC_USART7_RELEASE_RESET();
    __HAL_RCC_USART7_CLK_ENABLE();
    obj->index = UART7_INDEX;
    obj->irq = USART7_IRQn;
  }
#endif
#if defined(UART8_BASE)
  else if (obj->uart == UART8) {
    __HAL_RCC_UART8_FORCE_RESET();
    __HAL_RCC_UART8_RELEASE_RESET();
    __HAL_RCC_UART8_CLK_ENABLE();
    obj->index = UART8_INDEX;
    obj->irq = UART8_IRQn;
  }
#elif defined(USART8_BASE)
  else if (obj->uart == USART8) {
    __HAL_RCC_USART8_FORCE_RESET();
    __HAL_RCC_USART8_RELEASE_RESET();
    __HAL_RCC_USART8_CLK_ENABLE();
    obj->index = UART8_INDEX;
    obj->irq = USART8_IRQn;
  }
#endif
#if defined(UART9_BASE)
  else if (obj->uart == UART9) {
    __HAL_RCC_UART9_FORCE_RESET();
    __HAL_RCC_UART9_RELEASE_RESET();
    __HAL_RCC_UART9_CLK_ENABLE();
    obj->index = UART9_INDEX;
    obj->irq = UART9_IRQn;
  }
#endif
#if defined(UART10_BASE)
  else if (obj->uart == UART10) {
    __HAL_RCC_UART10_FORCE_RESET();
    __HAL_RCC_UART10_RELEASE_RESET();
    __HAL_RCC_UART10_CLK_ENABLE();
    obj->index = UART10_INDEX;
    obj->irq = UART10_IRQn;
  }
#endif
#if defined(USART10_BASE)
  else if (obj->uart == USART10) {
    __HAL_RCC_USART10_FORCE_RESET();
    __HAL_RCC_USART10_RELEASE_RESET();
    __HAL_RCC_USART10_CLK_ENABLE();
    obj->index = UART10_INDEX;
    obj->irq = USART10_IRQn;
  }
#endif
#if defined(USART11_BASE)
  else if (obj->uart == USART11) {
    __HAL_RCC_USART11_FORCE_RESET();
    __HAL_RCC_USART11_RELEASE_RESET();
    __HAL_RCC_USART11_CLK_ENABLE();
    obj->index = UART11_INDEX;
    obj->irq = USART11_IRQn;
  }
#endif
#if defined(UART12_BASE)
  else if (obj->uart == UART12) {
    __HAL_RCC_UART12_FORCE_RESET();
    __HAL_RCC_UART12_RELEASE_RESET();
    __HAL_RCC_UART12_CLK_ENABLE();
    obj->index = UART12_INDEX;
    obj->irq = UART12_IRQn;
  }
#endif
  else {
    if (obj != &serial_debug) {
      core_debug("ERROR: [U(S)ART] Peripheral not supported!\n");
    }
    return false;
  }
  /* Configure UART GPIO pins */
#if defined(UART_ADVFEATURE_SWAP_INIT)
  uint32_t pin_swap = UART_ADVFEATURE_SWAP_DISABLE;
#endif
  if (uart_tx != NP) {
    /* Regular GPIO */
    pinmap_pinout(obj->pin_tx, PinMap_UART_TX);
    if (uart_rx != NP) {
      pinmap_pinout(obj->pin_rx, PinMap_UART_RX);
    }
  }
#if defined(UART_ADVFEATURE_SWAP_INIT)
  else if (uart_tx_swap != NP) {
    /* Swapped GPIO */
    pinmap_pinout(obj->pin_tx, PinMap_UART_RX);
    if (uart_rx_swap != NP) {
      pinmap_pinout(obj->pin_rx, PinMap_UART_TX);
    }
    pin_swap = UART_ADVFEATURE_SWAP_ENABLE;
  }
#endif

  /* Configure flow control */
  uint32_t flow_control = UART_HWCONTROL_NONE;
  if (uart_rts != NP) {
    flow_control |= UART_HWCONTROL_RTS;
    pinmap_pinout(obj->pin_rts, PinMap_UART_RTS);
  }
  if (uart_cts != NP) {
    flow_control |= UART_HWCONTROL_CTS;
    pinmap_pinout(obj->pin_cts, PinMap_UART_CTS);
  }

  /* Configure uart */
  uart_handlers[obj->index] = huart;
  huart->Instance          = (USART_TypeDef *)(obj->uart);
  huart->Init.BaudRate     = baudrate;
  huart->Init.WordLength   = databits;
  huart->Init.StopBits     = stopbits;
  huart->Init.Parity       = parity;
  huart->Init.Mode         = UART_MODE_TX_RX;
  huart->Init.HwFlowCtl    = flow_control;
  huart->Init.OverSampling = UART_OVERSAMPLING_16;

  /* Configure UART Clock Prescaler */
#if defined(UART_PRESCALER_DIV1)
  huart->Init.ClockPrescaler = uart_compute_prescaler(huart);
  if (!IS_UART_PRESCALER(huart->Init.ClockPrescaler)) {
    if (obj != &serial_debug) {
      core_debug("WARNING: [U(S)ART] wrong prescaler, reset to UART_PRESCALER_DIV1!\n");
    }
    huart->Init.ClockPrescaler = UART_PRESCALER_DIV1;
  }
#endif

#if defined(UART_ADVFEATURE_NO_INIT)
  // Default value
  huart->AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
#if defined(UART_ADVFEATURE_SWAP_INIT)
  huart->AdvancedInit.AdvFeatureInit |= UART_ADVFEATURE_SWAP_INIT;
  huart->AdvancedInit.Swap = pin_swap;
#endif
#if defined(UART_ADVFEATURE_RXINVERT_INIT)
  if (rx_invert) {
    huart->AdvancedInit.AdvFeatureInit |= UART_ADVFEATURE_RXINVERT_INIT;
    huart->AdvancedInit.RxPinLevelInvert = UART_ADVFEATURE_RXINV_ENABLE;
  }
#endif
#if defined(UART_ADVFEATURE_TXINVERT_INIT)
  if (tx_invert) {
    huart->AdvancedInit.AdvFeatureInit |= UART_ADVFEATURE_TXINVERT_INIT;
    huart->AdvancedInit.TxPinLevelInvert = UART_ADVFEATURE_TXINV_ENABLE;
  }
#endif
#if defined(UART_ADVFEATURE_DATAINVERT_INIT)
  if (data_invert) {
    huart->AdvancedInit.AdvFeatureInit |= UART_ADVFEATURE_DATAINVERT_INIT;
    huart->AdvancedInit.DataInvert = UART_ADVFEATURE_DATAINV_ENABLE;
  }
#endif
#else /* UART_ADVFEATURE_NO_INIT */
  UNUSED(rx_invert);
  UNUSED(tx_invert);
  UNUSED(data_invert);
#endif
#ifdef UART_ONE_BIT_SAMPLE_DISABLE
  huart->Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
#endif

  /* Set the NVIC priority for future interrupts */
  HAL_NVIC_SetPriority(obj->irq, UART_IRQ_PRIO, UART_IRQ_SUBPRIO);

